<template>
  <div class="cooperation">
    <div class="cooperation__title">СОТРУДНИЧЕСТВО</div>
    <div class="multiclass" v-for="coop in cooperation" :key="coop.id">
      <div class="multiclass__header">{{ coop.title }}</div>
      <div class="multiclass__text">{{ coop.description }}</div>
    </div>
  </div>
</template>

<script setup lang="ts">
let cooperation = [
  {
    id: 1,
    title: "Разместите у нас свою рекламу",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  },
  {
    id: 2,
    title: "Станьте нашим партнером или спонсором ",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  },
  {
    id: 3,
    title: "Возьмите бесплатные журналы для вашей организации ",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  },
  {
    id: 4,
    title: "Пригласите нас прочитать лекцию для взрослых или дете",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  },
  {
    id: 5,
    title: "Станьте нашим автором или экспертом",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  },
  {
    id: 6,
    title: "Пройдите у нас студенческую практику",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  },
  {
    id: 7,
    title: "Станьте частью нашей команды",
    description: "А также элементы политического процесса формируют глобальную экономическую сеть и при этом" +
        " — описаны максимально подробно. Таким образом, существующая теория позволяет выполнить важные задания по " +
        "разработке экспериментов, поражающих по своей масштабности и грандиозности. Кстати, тщательные исследования " +
        "конкурентов неоднозначны и будут подвергнуты целой серии независимых исследований. Господа, убеждённость некоторых " +
        "оппонентов позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям." +
        " Как принято считать, представители современных социальных резеы.",
  }]
</script>

<style lang="scss" scoped>
.cooperation {
  background-color: #E2EDF6;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  padding-bottom: 80px;

  &__title {
    font-family: Bebas Neue Cyrillic, serif;
    font-weight: 400;
    font-size: 48px;
    line-height: 100%;
    letter-spacing: 0;
    text-align: center;
    color: black;
    padding: 30px;
  }
}

.multiclass {
  width: 75%;

  &__header {
    font-family: Bebas Neue Cyrillic, serif;
    font-weight: 400;
    font-size: 48px;
    line-height: 100%;
    letter-spacing: 0;
    text-align: center;
    color: #D24B35;
    padding: 10px;
    margin-top: 80px;
  }

  &__text {
    font-family: Roboto, serif;
    font-weight: 400;
    font-size: 24px;
    line-height: 100%;
    letter-spacing: 0;
    text-align: center;
    color: black;
    padding: 20px;
  }
}
</style>